health_backend/app/controllers/api/v1/auth_controller.rb

    def signup
        user = User.new(user_params)
        user.status = 1 # Set user as active on signup
        if user.save
---
INSERT INTO "users" ("email", "phone", "password_digest", "first_name", "last_name", "is_logged_in", "num_logins", "num_logouts", "status", "last_login_at", "last_logout_at", "deleted_at", "created_at", "updated_at") VALUES ('gopinathsiva49@gmail.com', '9962141518', '$2a$12$0VYsyU3Gfw6TwnvybuFNpe/j2EJs7MPtvOcFFJ2LEB8CUqM0ujcxe', 'gopinath', 'sivakumar', FALSE, 0, 0, 1, NULL, NULL, NULL, '2025-11-16 09:47:40.775594', '2025-11-16 09:47:40.775594') RETURNING "id"

    def login
        email = params[:email].to_s.strip
        password = params[:password].to_s

        if email.blank? || password.blank?
            return render json: { error: I18n.t('auth.login_required') }, status: :bad_request
        end

        user = User.find_by("lower(email) = ?", email.downcase)
---
SELECT "users".* FROM "users" WHERE (lower(email) = 'gopinathsiva49@gmail.com') LIMIT 1