app/controllers/concerns/token_authorization.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def authorize_request
        token = request.headers['Authorization']
        if token.blank?
            raise AppErrors::AuthError, I18n.t('auth.token_missing')
        end

        begin
            decoded = JsonWebToken.decode(token)
            @current_user = User.find_by(id: decoded[:user_id])